tests/appgw-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  JMeter 5.6 Load Test Plan: AI-as-a-Service — App Gateway WAF v2 Performance
  ===========================================================================

  PURPOSE
  =======
  Mirror of apim-load-test.jmx but routed through the App Gateway WAF v2 layer.
  Traffic path per request:
    JMeter → AppGW WAF v2 (HTTPS 443, self-signed cert) → APIM Internal VNet → AI Foundry

  Compare results against apim-load-test.jmx runs for before/after analysis:
  - Added latency from WAF inspection (expect +10-30 ms)
  - Additional TLS hop (AppGW terminates, re-encrypts to APIM)
  - WAF OWASP CRS 3.2 rule evaluation overhead

  SSL SETUP (setUp Thread Group)
  ==============================
  App Gateway uses a self-signed cert (CN=agw-contoso-ai-primary.eastus.cloudapp.azure.com).
  The setUp Thread Group installs a trust-all SSL context BEFORE any HTTP request so the
  self-signed cert does not cause handshake failures.
  Only used for this performance comparison test — production clients should validate certs.

  PREREQUISITES (Azure Load Testing)
  ===================================
  ALT test APPGW_HOSTNAME env var must be set to:
    agw-contoso-ai-primary.eastus.cloudapp.azure.com

  ALT env vars (same as apim-smoke-test):
    APIM_HOSTNAME = agw-contoso-ai-primary.eastus.cloudapp.azure.com
    API_VERSION   = 2024-10-21
    BRONZE_KEY    = <bronze subscription key>
    SILVER_KEY    = <silver subscription key>

  Additional test files uploaded to ALT:
    appgw-truststore.p12   — PKCS12 truststore (generated by scripts/create-appgw-cert.ps1)
    appgw-system.properties — javax.net.ssl.trustStore pointer

  TEST SUITES
  ===========
  Suite 1  [Bronze] Chat completions (gpt-4o-mini)               — expect 200
  Suite 2  [Bronze] Model allowlist block (gpt-4o via Bronze key) — expect 403 (APIM policy still enforced)
  Suite 3  [Silver] Chat completions (gpt-4o-mini)               — expect 200
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="AI-as-a-Service APIM via AppGW WAF v2" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

      <!-- User-defined variables: Azure Load Testing injects environmentVariables as JMeter -J properties.
           Reference them with ${__P(VAR,default)}. For local runs: jmeter -JAPIM_HOSTNAME=... -JBRONZE_KEY=... -JSILVER_KEY=...
           Keys never committed to git - stored on the ALT test definition via run-appgw-load-test.ps1 -->
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="APIM_HOSTNAME" elementType="Argument">
            <stringProp name="Argument.name">APIM_HOSTNAME</stringProp>
            <stringProp name="Argument.value">${__P(APIM_HOSTNAME,agw-contoso-ai-primary.eastus.cloudapp.azure.com)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="API_VERSION" elementType="Argument">
            <stringProp name="Argument.name">API_VERSION</stringProp>
            <stringProp name="Argument.value">${__P(API_VERSION,2024-10-21)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <!-- BRONZE_KEY and SILVER_KEY are injected by Azure Load Testing as JMeter -J properties.
               The correct runtime pattern is ${__P(VAR,default)}.
               Keys are never committed to git. -->
          <elementProp name="BRONZE_KEY" elementType="Argument">
            <stringProp name="Argument.name">BRONZE_KEY</stringProp>
            <stringProp name="Argument.value">${__P(BRONZE_KEY,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SILVER_KEY" elementType="Argument">
            <stringProp name="Argument.name">SILVER_KEY</stringProp>
            <stringProp name="Argument.value">${__P(SILVER_KEY,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ================================================================= -->
      <!-- setUp Thread Group: Trust-all SSL for self-signed AppGW cert       -->
      <!-- Runs BEFORE any HTTP request so JMeter's SSL manager sees the      -->
      <!-- trust-all context before it initializes for the first HTTPS call.  -->
      <!-- ================================================================= -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup"
                        testname="[Setup] Install trust-all SSL for AppGW self-signed cert"
                        enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler"
                       testname="Trust-all SSL context (AppGW self-signed cert)" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import javax.net.ssl.*
import java.security.*
import java.security.cert.X509Certificate

// ── Primary fix: system.properties (javax.net.ssl.trustStore=NONE) ────────────
// Uploaded as ADDITIONAL_ARTIFACTS so JMeter reads it at startup via $user.dir.
// This script is a belt-and-suspenders backup in case system.properties
// is not picked up before JsseSSLManager initialises.

// ── Step 1: Set JVM system properties ─────────────────────────────────────────
System.setProperty("javax.net.ssl.trustStore",         "NONE")
System.setProperty("javax.net.ssl.trustStoreType",     "JKS")
System.setProperty("javax.net.ssl.trustStorePassword", "")

// ── Step 2: Reset JMeter's JsseSSLManager cached context ──────────────────────
// JsseSSLManager caches the SSLContext in an instance field 'defaultContext'.
// Nulling it forces a fresh call to createContext() which reads the NONE property → trust-all.
try {
    def sslManager = Class.forName("org.apache.jmeter.util.SSLManager")
                          .getDeclaredMethod("getInstance").invoke(null)
    def ctxField = Class.forName("org.apache.jmeter.util.JsseSSLManager")
                        .getDeclaredField("defaultContext")
    ctxField.setAccessible(true)
    ctxField.set(sslManager, null)   // instance field — pass the singleton, not null
    log.info("[AppGW SSL] JsseSSLManager.defaultContext reset — trust-all will apply")
} catch (Exception e) {
    log.info("[AppGW SSL] JsseSSLManager reset skipped (may already be NONE): " + e.message)
}

// ── Step 3: Install trust-all JVM default (covers HttpsURLConnection fallback) ─
def trustAll = [
    checkClientTrusted: { chain, authType -> },
    checkServerTrusted: { chain, authType -> },
    getAcceptedIssuers: { [] as X509Certificate[] }
] as X509TrustManager

def sc = SSLContext.getInstance("TLS")
sc.init(null, [trustAll] as TrustManager[], new SecureRandom())
SSLContext.setDefault(sc)
HttpsURLConnection.setDefaultSSLSocketFactory(sc.getSocketFactory())
HttpsURLConnection.setDefaultHostnameVerifier({ hostname, session -> true } as HostnameVerifier)

log.info("[AppGW SSL] Trust-all SSL installed for App Gateway self-signed cert (CN=agw-contoso-ai-primary.eastus.cloudapp.azure.com).")

// ── Step 4: Ensure APIM subscription keys are set as JMeter properties ────────
// ALT passes --env variables as JMeter -J properties.  Belt-and-suspenders:
// if the property is missing (e.g. preview-CLI injection bug), fall back to OS env var.
// NOTE: Use string concatenation (not GString) — JMeter substitutes ${} before Groovy runs.
['BRONZE_KEY', 'SILVER_KEY', 'APIM_HOSTNAME', 'API_VERSION'].each { varName -&gt;
    def current = props.get(varName)
    if (current != null &amp;&amp; current.length() &gt; 0) {
        log.info("[Config] " + varName + " already in JMeter props (len=" + current.length() + ")")
    } else {
        def fromEnv = System.getenv(varName)
        if (fromEnv != null &amp;&amp; fromEnv.length() &gt; 0) {
            props.put(varName, fromEnv)
            log.info("[Config] " + varName + " loaded from OS env (len=" + fromEnv.length() + ")")
        } else {
            log.warn("[Config] " + varName + " is EMPTY in both JMeter props AND OS env!")
        }
    }
}
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- ================================================================= -->
      <!-- Suite 1: Bronze — chat completions with gpt-4o-mini (expect 200)  -->
      <!-- Identical to apim-load-test.jmx Suite 1; traffic via AppGW WAF.   -->
      <!-- 5 threads × 10 min sustained. 30s think time → ~10 RPM             -->
      <!-- gpt-4o-mini deployment cap: 10K TPM ≈ 60 RPM total across suites  -->
      <!-- ================================================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[Bronze] Chat Completions — gpt-4o-mini" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">600</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- User-Agent and Accept headers bypass WAF Bot Manager rules 300300+300700
             and OWASP rule 920300 (missing Accept header). -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="Bronze Auth Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Ocp-Apim-Subscription-Key" elementType="Header">
              <stringProp name="Header.name">Ocp-Apim-Subscription-Key</stringProp>
              <stringProp name="Header.value">${BRONZE_KEY}</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="User-Agent" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- 30s think time: gpt-4o-mini capacity=10 (10K TPM) → max ~60 RPM total.
             5 threads × 30s delay → ~10 RPM from this suite. -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="Think Time — pace under 60 RPM OpenAI cap" enabled="true">
          <stringProp name="ConstantTimer.delay">30000</stringProp>
        </ConstantTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /openai/deployments/gpt-4o-mini/chat/completions"
                          enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"messages":[{"role":"user","content":"Reply with exactly one word: Hello"}],"max_tokens":5}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${APIM_HOSTNAME}</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/openai/deployments/gpt-4o-mini/chat/completions?api-version=${API_VERSION}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert 200 OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Bronze gpt-4o-mini via AppGW must return 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ================================================================= -->
      <!-- Suite 2: Bronze — model allowlist (gpt-4o → 403 at APIM policy)   -->
      <!-- WAF passes; APIM still blocks. Confirms policy still works via GW. -->
      <!-- ================================================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[Bronze] Chat Completions — gpt-4o-mini (burst)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">3</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">2</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- User-Agent and Accept headers bypass WAF Bot Manager rules 300300+300700
             and OWASP rule 920300 (missing Accept header). -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="Bronze Auth Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Ocp-Apim-Subscription-Key" elementType="Header">
              <stringProp name="Header.name">Ocp-Apim-Subscription-Key</stringProp>
              <stringProp name="Header.value">${BRONZE_KEY}</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="User-Agent" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="Think Time — pace burst suite" enabled="true">
          <stringProp name="ConstantTimer.delay">10000</stringProp>
        </ConstantTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST chat/completions (model=gpt-4o-mini)" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"messages":[{"role":"user","content":"Reply with one word: Hello"}],"max_tokens":5}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${APIM_HOSTNAME}</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/openai/deployments/gpt-4o-mini/chat/completions?api-version=${API_VERSION}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert 200 OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Bronze gpt-4o-mini (burst) via AppGW must return 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ================================================================= -->
      <!-- Suite 3: Silver — chat completions (higher concurrency, expect 200)-->
      <!-- 10 threads × 10 min sustained. 30s think time → ~20 RPM            -->
      <!-- Combined with Suite 1 (~10 RPM): ~30 RPM total, within 60 RPM cap  -->
      <!-- ================================================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[Silver] Chat Completions — gpt-4o-mini" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">600</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- User-Agent and Accept headers bypass WAF Bot Manager rules 300300+300700
             and OWASP rule 920300 (missing Accept header). -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="Silver Auth Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Ocp-Apim-Subscription-Key" elementType="Header">
              <stringProp name="Header.name">Ocp-Apim-Subscription-Key</stringProp>
              <stringProp name="Header.value">${SILVER_KEY}</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="User-Agent" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- 30s think time: 10 threads × 30s delay → ~20 RPM from this suite. -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="Think Time — pace under 60 RPM OpenAI cap" enabled="true">
          <stringProp name="ConstantTimer.delay">30000</stringProp>
        </ConstantTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /openai/deployments/gpt-4o-mini/chat/completions"
                          enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"messages":[{"role":"user","content":"Reply with exactly one word: Hello"}],"max_tokens":5}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${APIM_HOSTNAME}</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/openai/deployments/gpt-4o-mini/chat/completions?api-version=${API_VERSION}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert 200 OK" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Silver gpt-4o-mini via AppGW must return 200</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- Summary Report -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector"
                       testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>